# -*- coding: utf-8 -*-

# (if/elif/else)

# По номеру месяца вывести кол-во дней в нем (без указания названия месяца, в феврале 28 дней)
# Результат проверки вывести на консоль
# Если номер месяца некорректен - сообщить об этом

# Номер месяца получать от пользователя следующим образом
user_input = input("Введите, пожалуйста, номер месяца: ")
month = int(user_input)
print('Вы ввели', month)

# TODO здесь ваш код

user_input = input("Введите, пожалуйста, номер месяца: ", )
if user_input.isdigit():
    month = int(user_input)
    if month in range(1, 13):
        print('Вы ввели', month, 'й месяц')
        if month in [1, 3, 5, 7, 8, 10, 12]:
            print('В этом месяце 31 день')
        elif month in [4, 6, 9, 11]:
            print('В этом месяце 30 дней')
        else:
            print('Это уникальный месяц Февраль - в нем 28 дней')
    else:
        print('Месяцев всего 12.. Укажите номер месяца от 1 до 12')
else:
    print('Необходимо ввести число от 1 до 12')
