# -*- coding: utf-8 -*-

# (цикл while)

# даны целые положительные числа a и b (a > b)
# Определить результат целочисленного деления a на b, с помощью цикла while,
# __НЕ__ используя стандартную операцию целочисленного деления (// и %)
# Формат вывода:
#   Целочисленное деление ХХХ на YYY дает ZZZ

a, b = 179, 37

# TODO здесь ваш код

div_a = a
divide_value = 0
while div_a >= b:
    div_a -= b
    divide_value += 1
else:
    print('Целочисленное деление ', a, 'на ', b, 'даёт ', divide_value)
