# -*- coding: utf-8 -*-

# (определение функций)
import simple_draw

# Написать функцию отрисовки смайлика в произвольной точке экрана
# Форма рожицы-смайлика на ваше усмотрение
# Параметры функции: кордината X, координата Y, цвет.
# Вывести 10 смайликов в произвольных точках экрана.

# TODO здесь ваш код

# Тут я решил, что хватит с меня этих ебучих заданий с бесполезной библиотекой поэтому вот вам 10 смайликов блять
print('(o･ω･o)   (*^ω^)   (◕‿◕)   (o˘◡˘o)   (˙꒳​˙)')
print('(´･ᴗ･)   (╯✧▽✧)╯   \(★ω★)/   ＼(￣▽￣)／   o(≧▽≦)o')

