#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = [
    'Мама',
    'Папа',
    'Жена'
]

# список списков приблизителного роста членов вашей семьи
my_family_height = [
    ['Мама', 165],
    ['Папа', 172],
    ['Жена', 175]
    # ['имя', рост],
]

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см

print (str('Рост отца - ' + str(my_family_height [1][1]) + ' см'))

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см

print (str('Общий рост моей семьи - ' + str(my_family_height[1][1] + my_family_height[0][1] + my_family_height[2][1] ) + ' см'))
